package ru.dobro.constants;

import ru.dobro.domain.ShopAddressLocation;

public class MapConstant {

    public static final ShopAddressLocation[] SHOP_ADDRESS_LOCATIONS =
    {
            new ShopAddressLocation(1, "РБ", "МОГИЛЕВСКАЯ ", "г. Бобруйск, ул. Орджоникидзе, 18 А", 53.16239659556647, 29.203195754630976),
            new ShopAddressLocation(2, "РБ", "МИНСКАЯ", "г. Борисов, ул. Даумана, 78", 54.213687570418315, 28.491021500000016),
            new ShopAddressLocation(3, "РБ", "МИНСКАЯ", "г. Жодино, ул. Московская, 66", 54.09496915214197, 28.33292962831112),
            new ShopAddressLocation(4, "РБ", "МОГИЛЕВСКАЯ ", "г. Осиповичи, ул. Социалистическая, 37 Б", 53.290971071160016, 28.634383500000016),
            new ShopAddressLocation(5, "РБ", "МОГИЛЕВСКАЯ ", "г. Могилев, пер. Тагильский, 1 Б", 53.8786267357133, 30.391668118412813),
            new ShopAddressLocation(6, "РБ", "МИНСКАЯ", "г. Марьина Горка, ул. Калинина, 3", 53.51788107099002, 28.140184499999933),
            new ShopAddressLocation(7, "РБ", "МОГИЛЕВСКАЯ ", "г. Могилев, ул. Турова, 1", 53.944325070631606, 30.363667499999956),
            new ShopAddressLocation(8, "РБ", "ГОМЕЛЬСКАЯ ", "г. Гомель, 1-ый Севастопольский переулок, 49", 52.3804955718397, 31.019572499999903),
            new ShopAddressLocation(9, "РБ", "БРЕСТСКАЯ", "г. Пинск, Иркутско-пинской дивизии, 61", 52.12582807201284, 26.12682649999996),
            new ShopAddressLocation(10, "РБ", "ГОМЕЛЬСКАЯ ", "г. Мозырь, ул. Советская, 19 В", 52.06080357204508, 29.2392015),
            new ShopAddressLocation(11, "РБ", "БРЕСТСКАЯ", "г. Пружаны, ул. Октябрьская, 102 Б", 52.56572857168603, 24.464709499999987),
            new ShopAddressLocation(13, "РБ", "ГРОДНЕНСКАЯ", "г. Скидель, ул. Ленина, 74", 53.58378407092717, 24.2470385),
            new ShopAddressLocation(14, "РБ", "БРЕСТСКАЯ", "г. Брест, ул. Лейтенанта Рябцева, 29/1", 52.12154572801288, 23.67154200132781),
            new ShopAddressLocation(15, "РБ", "БРЕСТСКАЯ", "г. Пинск, ул. Карла Маркса, 32", 52.125636363257975, 26.114942399475076),
            new ShopAddressLocation(16, "РБ", "БРЕСТСКАЯ", "г. Брест, ул. Янки Купалы, 132", 52.114951521067326, 23.773624653442365),
            new ShopAddressLocation(17, "РБ", "МОГИЛЕВСКАЯ ", "г. Кричев, ул. Бирюзова, 14", 53.70485002782933, 31.728601559524527),
            new ShopAddressLocation(18, "РБ", "ГРОДНЕНСКАЯ", "г. Слоним, ул. Комсомольская, 8", 53.09841507130078, 25.319447499999967),
            new ShopAddressLocation(19, "РБ", "БЕЛАРУСЬ", "г. Островец, ул. К.Маркса 37\1 (на открытии)", 54.62306739346834, 25.961688999999975),
    };

}
